Repository: ESUCC/Maximd
Catalog: application/translation/form001/page2.tmx
Source language: es
Languages: en

source: La continuación del consentimiento para una evaluacion inicial
en: Notice and Consent for Initial Evaluation Continued

source: A continuación se presenta una descripción de los componentes de la evaluación multidisciplinaria que el distrito propone llevar a cabo.
en: Following is a description of the components of the multidisciplinary evaluation which the district proposes to conduct

source: Descripción de la evaluación multidisciplinaria
en: Multidisciplinary Evaluation Description

source: Los padres de niños con discapacidades tienen derechos que están protegidos bajo las garantías de procedimiento de la la Ley para Individuos con Discapacidades (IDEA -Individuals with Disabilities Act). Una copia de sus derechos como padres se encuentra adjunta. Si tiene alguna pregunta sobre esta notificación o sobre sus derechos, usted puede contactar a
en: Parents of children with disabilities have rights which are protected under the procedural safeguards of the Individuals with Disabilities Act (IDEA). A copy of your parental rights is enclosed. If you have any questions regarding this notice or your rights you may contact

source: Needs translation.
en: Records for your child are no longer needed to provide educational services to your child when five (5) years has passed since the record was last created or revised and your child has moved to the next building level except records designated in Board policy as a permanent individual record, and is subject to destruction once that period is elapsed.

source: Nombre
en: Name

source: Número telefónico
en: Phone Number

source: Otro
en: Other

source: Del Habla e Idioma
en: Speech and Language

source: Social y Emocional
en: Social and Emotional

source: Peceptual y motriz
en: Perceptual and Motor

source: Intelectual
en: Intellectual

source: Académico
en: Academic
